system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version: 13                                     |
|   \\  /    A nd           |                                                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

convertToMeters 1.0;

vertices
(
    (-5 -10 -0.05)
    (15 -10 -0.05)
    (15  10 -0.05)
    (-5  10 -0.05)

    (-5 -10  0.05)
    (15 -10  0.05)
    (15  10  0.05)
    (-5  10  0.05)
);

blocks
(
    hex (0 1 2 3 4 5 6 7)
    (400 200 1)
    simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }

    outlet
    {
        type patch;
        faces
        (
            (1 2 6 5)
        );
    }

    lowerWall
    {
        type symmetryPlane;
        faces
        (
            (0 1 5 4)
        );
    }

    upperWall
    {
        type symmetryPlane;
        faces
        (
            (3 7 6 2)
        );
    }

    front
    {
        type empty;
        faces
        (
            (0 3 2 1)
        );
    }

    back
    {
        type empty;
        faces
        (
            (4 5 6 7)
        );
    }
);

mergePatchPairs
(
);
