system/snappyHexMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      snappyHexMeshDict;
}

// ---------------------- CONTROL ---------------------- //

castellatedMesh true;
snap            true;
addLayers       false;

// ---------------------- GEOMETRY ---------------------- //

geometry
{
    NACA4418
    {
        type triSurfaceMesh;
        file "NACA4418.stl";
    }
};

// ---------------------- CASTELLATION ---------------------- //

castellatedMeshControls
{
    maxLocalCells 200000;
    maxGlobalCells 1000000;
    minRefinementCells 0;

    nCellsBetweenLevels 3;

    resolveFeatureAngle 30;

    locationInMesh (2 0 0);

    allowFreeStandingZoneFaces true;

    features
    (
    );

    refinementSurfaces
    {
        NACA4418
        {
            level (3 4);
        }
    }

    refinementRegions
    {
    }

}

// ---------------------- SNAP ---------------------- //

snapControls
{
    nSmoothPatch 3;
    tolerance 2.0;
    nSolveIter 30;
    nRelaxIter 5;
    nFeatureSnapIter 10;
    implicitFeatureSnap false;
    explicitFeatureSnap true;
    multiRegionFeatureSnap false;
}

// ---------------------- ADD LAYERS ---------------------- //

addLayersControls
{
}

// ---------------------- QUALITY ---------------------- //

meshQualityControls
{
    maxNonOrtho 65;
    maxBoundarySkewness 20;
    maxInternalSkewness 4;
    maxConcave 80;

    minFlatness 0.5;
    minVol 1e-13;
    minTetQuality 1e-9;

    minArea -1;
    minTwist 0.02;
    minDeterminant 0.001;
    minFaceWeight 0.02;
    minVolRatio 0.01;

    nSmoothScale 4;
    errorReduction 0.75;
}

// ---------------------- WRITE ---------------------- //

debug 0;
mergeTolerance 1e-6;
