0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version: 13                                     |
|   \\  /    A nd           |                                                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (20 0 0);

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform (20 0 0);
    }

    outlet
    {
        type            zeroGradient;
    }

    upperWall
    {
        type            symmetryPlane;
    }

    lowerWall
    {
        type            symmetryPlane;
    }

    NACA4418
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    front
    {
        type            empty;
    }

    back
    {
        type            empty;
    }
}

// ************************************************************************* //
